configs/PROD_REQUEST_DATA.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://homecredit.net/externalservices/verification/v1">
    <soapenv:Header/>
    <soapenv:Body>
        <v1:GetExternalServiceRequest>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_BFD_1</serviceCode>
                <serviceData>
                    <key>name</key>
                    <stringValue>贺银为</stringValue>
                </serviceData>
                <serviceData>
                    <key>ident</key>
                    <stringValue>110224198304295631</stringValue>
                </serviceData>
                <serviceData>
                    <key>Mobil</key>
                    <stringValue>13910005242</stringValue>
                </serviceData>
                <serviceData>
                    <key>Email</key>
                    <stringValue/>
                </serviceData>
                <serviceData>
                    <key>Bank Account Number</key>
                    <stringValue/>
                </serviceData>
                <serviceData>
                    <key>Application Date</key>
                    <dateValue/>
                </serviceData>
            </services>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_QQ_FARM_2</serviceCode>
                <serviceData>
                    <key>Email</key>
                    <stringValue>176107970@qq.com</stringValue>
                </serviceData>
            </services>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_ESHOP_5</serviceCode>
                <serviceData>
                    <key>ContractNum</key>
                    <stringValue>3642982127001</stringValue>
                </serviceData>
            </services>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_UNION_PAY_VER_6</serviceCode>
                <serviceData>
                    <key>Bank_Account_Num</key>
                    <stringValue>6236682920002514204</stringValue>
                </serviceData>
                <serviceData>
                    <key>Name</key>
                    <stringValue>宋龙龙</stringValue>
                </serviceData>
            </services>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_EBU_VER_7</serviceCode>
                <serviceData>
                    <key>ID</key>
                    <stringValue>360302198711300022</stringValue>
                </serviceData>
                <serviceData>
                    <key>Mobil</key>
                    <stringValue>15876559947</stringValue>
                </serviceData>
                <serviceData>
                    <key>Bank_Account_Num</key>
                    <stringValue>6228480058527861772</stringValue>
                </serviceData>
                <serviceData>
                    <key>Name</key>
                    <stringValue>叶丽婷</stringValue>
                </serviceData>
            </services>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_FRAUDMETRIX_8</serviceCode>
                <serviceData>
                    <key>id_number</key>
                    <stringValue>48392029190002034031</stringValue>
                </serviceData>
                <serviceData>
                    <key>name</key>
                    <stringValue>张三</stringValue>
                </serviceData>
                <serviceData>
                    <key>mobile</key>
                    <stringValue>18392049382</stringValue>
                </serviceData>
                <serviceData>
                    <key>email</key>
                    <stringValue>example@qq.com</stringValue>
                </serviceData>
                <serviceData>
                    <key>card_number</key>
                    <stringValue>6220039483930293830</stringValue>
                </serviceData>
            </services>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_INTELLICREDIT_9</serviceCode>
                <serviceData>
                    <key>name</key>
                    <stringValue>傅甜甜</stringValue>
                </serviceData>
                <serviceData>
                    <key>id</key>
                    <stringValue>342523198905150723</stringValue>
                </serviceData>
                <serviceData>
                    <key>mobile</key>
                    <stringValue>18297552904</stringValue>
                </serviceData>
            </services>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_UMS_VER_10</serviceCode>
                <serviceData>
                    <key>Name</key>
                    <stringValue>姓名</stringValue>
                </serviceData>
                <serviceData>
                    <key>Ident</key>
                    <stringValue>0000000000300900</stringValue>
                </serviceData>
                <serviceData>
                    <key>Mobil</key>
                    <stringValue>15222571285</stringValue>
                </serviceData>
                <serviceData>
                    <key>Bank_Account_Number</key>
                    <stringValue>62220203000000000000</stringValue>
                </serviceData>
            </services>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_BEHAVIOR_VAR_11</serviceCode>
                <serviceData>
                    <key>ContractNum</key>
                    <stringValue>3552104955001</stringValue>
                </serviceData>
            </services>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_BEE_MOBILE_PHONE_CHECK_14</serviceCode>
                <!--1 or more repetitions:-->
                <serviceData>
                    <key>Mobile_phone_number</key>
                    <!--Optional:-->
                    <stringValue>15337370011</stringValue>
                    <!--stringValue>15337370011</stringValue-->
                </serviceData>
            </services>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_PY_MOBILE_PHONE_STATUS_15</serviceCode>
                <serviceData>
                    <key>Mobile_phone_number</key>
                    <stringValue>13012345678</stringValue>
                </serviceData>
                <serviceData>
                    <key>Name</key>
                    <stringValue>测试</stringValue>
                </serviceData>
                <serviceData>
                    <key>ID_number</key>
                    <stringValue>120222123456789012</stringValue>
                </serviceData>
            </services>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_SUANHUA_16</serviceCode>
                <serviceData>
                    <key>mobileNum</key>
                    <stringValue>13820452762</stringValue>
                </serviceData>
            </services>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_UPA_17</serviceCode>
                <serviceData>
                    <key>Bank_Account_Number</key>
                    <stringValue>6222020200096275025</stringValue>
                </serviceData>
            </services>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_TECH_VAR_18</serviceCode>
                <serviceData>
                    <key>ContractNum</key>
                    <stringValue>3552104955001</stringValue>
                </serviceData>
            </services>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_PHONE_DOMAIN_19</serviceCode>
                <serviceData>
                    <key>Mobil</key>
                    <stringValue>18920020202</stringValue>
                </serviceData>
            </services>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_PENGYUAN_EDUCATION_SCORE_20</serviceCode>
                <serviceData>
                    <key>ID_number</key>
                    <stringValue>120224199602196646</stringValue>
                </serviceData>
                <serviceData>
                    <key>Name</key>
                    <stringValue>曹丽媛</stringValue>
                </serviceData>
                <serviceData>
                    <key>College_name</key>
                    <stringValue>天津工业大学</stringValue>
                </serviceData>
                <serviceData>
                    <key>Education_level</key>
                    <stringValue>本科</stringValue>
                </serviceData>
                <serviceData>
                    <key>Enrollment_year</key>
                    <dateValue>2009</dateValue>
                </serviceData>
            </services>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_FM_FINGERPRINT_21</serviceCode>
                <serviceData>
                    <key>Order_ID</key>
                    <stringValue>1234567</stringValue>
                </serviceData>
            </services>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_OFFICE_PHONE_CHECK_23</serviceCode>
                <serviceData>
                    <key>Employer_name</key>
                    <stringValue>曲阜市鑫华矿山配件有限公司</stringValue>
                </serviceData>
                <serviceData>
                    <key>Employer_phone</key>
                    <stringValue>3190458</stringValue>
                </serviceData>
                <serviceData>
                    <key>Employer_phone_ac</key>
                    <stringValue>0537</stringValue>
                </serviceData>
            </services>
            <!--==========================================================================-->
            <services>
                <serviceCode>AUTO_PINGAN_22</serviceCode>
                <serviceData>
                    <key>idNo</key>
                    <stringValue>120103199008183511</stringValue>
                </serviceData>
                <serviceData>
                    <key>name</key>
                    <stringValue>衣测试</stringValue>
                </serviceData>
                <serviceData>
                    <key>mobileNo</key>
                    <stringValue>13820100550</stringValue>
                </serviceData>
                <serviceData>
                    <key>cardNo</key>
                    <stringValue>6222600210010114935</stringValue>
                </serviceData>
            </services>
        </v1:GetExternalServiceRequest>
    </soapenv:Body>
</soapenv:Envelope>